Catalogs/ПакетыОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПакетыОпционов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Держатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДержателиОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОпционов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВестинга</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВестинга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДосрочногоЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВызревшиеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроданныеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПакетаОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокОпционов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МодульВестинга/Ext/Module.bsl
Функция РассчитатьВестинг(ДатаНачала, Срок, Количество) Экспорт    Если ДатаНачала = Неопределено Тогда        Возврат 0;    КонецЕсли;         ТекущаяДата = ТекущаяДата();    ВсегоНачислено = 0;        // Первый транш (25%)    ДатаРасчета = КонецМесяца(ДобавитьМесяц(ДатаНачала, 12));    Если ДатаРасчета <= ТекущаяДата Тогда        НачисленныеОпционы = Окр((Количество * 1 / (Срок * 12))*12, 0);        ВсегоНачислено = ВсегоНачислено + НачисленныеОпционы;    Иначе        Возврат 0;    КонецЕсли;        // Остальные ежемесячные начисления 
	Для i = 1 По (Срок * 12 - 12) Цикл        ДатаРасчета = КонецМесяца(ДобавитьМесяц(ДатаРасчета, 1));                Если ДатаРасчета > ТекущаяДата Тогда            Прервать;        КонецЕсли;                НачисленныеОпционы = Окр(Количество * 1 / (Срок * 12), 0);              ВсегоНачислено = ВсегоНачислено + НачисленныеОпционы; 
	
	КонецЦикла;  
	
	Если ВсегоНачислено > Количество Тогда
			ВсегоНачислено = Количество;
	КонецЕсли;
        Возврат ВсегоНачислено;КонецФункции      

&НаСервереПроцедура ОбновлениеСправочникаПакетыОпционов() Экспорт    // Получаем все элементы справочника ПакетыОпционов    ЭлементыСправочника = Справочники.ПакетыОпционов.Выбрать();        Пока ЭлементыСправочника.Следующий() Цикл        // Получаем текущий элемент        ТекущийЭлемент = ЭлементыСправочника.ПолучитьОбъект();                // Вычисляем вестинг для текущего элемента        КоличествоОпционов = МодульВестинга.РассчитатьВестинг(            ТекущийЭлемент.ДатаНачалаВестинга,
            ТекущийЭлемент.СрокВестинга,            ТекущийЭлемент.КоличествоОпционов        );                // Обновляем значение в справочнике        ТекущийЭлемент.ВызревшиеОпционы = КоличествоОпционов;                // Записываем изменения        ТекущийЭлемент.Записать();	КонецЦикла;   
КонецПроцедуры
